PCIS_prod/src/InformationRegisters/ХодВыполненияЗадачи/ХодВыполненияЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияЗадачи</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Этап</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ХодВыполненияЭтапа/ХодВыполненияЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияЭтапа</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Этап</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/InformationRegisters/ХодВыполненияПроекта/ХодВыполненияПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодВыполненияПроекта</name>
  <resources>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проект</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PCIS_prod/src/Catalogs/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проект</name>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/CommonModules/ПроектныеРасчеты/Module.bsl
// Общий модуль "ПроектныеРасчеты"// Этот модуль предназначен только для серверной логики&НаСервере// ==============================================================// ОСНОВНЫЕ ПРОЦЕДУРЫ ДЛЯ ПЕРЕСЧЕТА// ==============================================================Процедура ОбновитьПоЗадаче(ЗадачаСсылка) Экспорт        Если НЕ ЗначениеЗаполнено(ЗадачаСсылка) Тогда        Возврат;    КонецЕсли;    ПересчитатьЗадачу(ЗадачаСсылка);    ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();        Если ЗадачаОбъект = Неопределено Или НЕ ЗначениеЗаполнено(ЗадачаОбъект.Владелец) Тогда        Возврат;    КонецЕсли;        ПересчитатьЭтап(ЗадачаОбъект.Владелец);        ЭтапОбъект = ЗадачаОбъект.Владелец.ПолучитьОбъект();        Если ЭтапОбъект = Неопределено Или НЕ ЗначениеЗаполнено(ЭтапОбъект.Владелец) Тогда        Возврат;    КонецЕсли;        ПересчитатьПроект(ЭтапОбъект.Владелец);КонецПроцедуры     
Процедура ОбновитьВсеОбъекты() Экспорт        Запрос = Новый Запрос;    Запрос.Текст =    "ВЫБРАТЬ    |   Проект.Ссылка    |ИЗ    |   Справочник.Проект КАК Проект";        Выборка = Запрос.Выполнить().Выбрать();        Пока Выборка.Следующий() Цикл        Попытка            ПересчитатьПроект(Выборка.Ссылка);        Исключение            Сообщить(ОписаниеОшибки());        КонецПопытки;    КонецЦикла;    КонецПроцедуры// ==============================================================// СОЗДАНИЕ ЗАПИСЕЙ В РЕГИСТРАХ// ==============================================================Процедура СоздатьРегистрЗадачи(ЗадачаСсылка) Экспорт        Если НЕ ЗначениеЗаполнено(ЗадачаСсылка) Тогда        Возврат;    КонецЕсли;        Запрос = Новый Запрос;    Запрос.Текст =    "ВЫБРАТЬ ПЕРВЫЕ 1    |   Ход.Задача    |ИЗ    |   РегистрСведений.ХодВыполненияЗадачи КАК Ход    |ГДЕ    |   Ход.Задача = &Задача";        Запрос.УстановитьПараметр("Задача", ЗадачаСсылка);        Если НЕ Запрос.Выполнить().Пустой() Тогда        Возврат;    КонецЕсли;        Задача = ЗадачаСсылка.ПолучитьОбъект();        Если Задача = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Задача.Владелец) Тогда        Возврат;    КонецЕсли;        ЭтапОбъект = Задача.Владелец.ПолучитьОбъект();        Если ЭтапОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ЭтапОбъект.Владелец) Тогда        Возврат;    КонецЕсли;        Запись = РегистрыСведений.ХодВыполненияЗадачи.СоздатьМенеджерЗаписи();    Запись.Задача = ЗадачаСсылка;    Запись.Этап = Задача.Владелец;    Запись.Проект = ЭтапОбъект.Владелец;    Запись.ПроцентВыполнения = 0;    Запись.СтатусВыполнения = "Запланирована";    Запись.ФактДатаНачала = Неопределено;    Запись.ФактДатаОкончания = Неопределено;    Запись.Записать();    КонецПроцедуры// ==============================================================// ПЕРЕСЧЕТ ЗАДАЧ// ==============================================================Процедура ПересчитатьЗадачу(ЗадачаСсылка)    Задача = ЗадачаСсылка.ПолучитьОбъект();        Если Задача = Неопределено Тогда        Возврат;    КонецЕсли;        Процент = ?(ЗначениеЗаполнено(Задача.ПроцентВыполнения), Задача.ПроцентВыполнения, 0);    Запрос = Новый Запрос;    Запрос.Текст =     "ВЫБРАТЬ    |   Ход.ПроцентВыполнения КАК СтарыйПроцент,    |   Ход.ФактДатаНачала КАК ФактНачало,    |   Ход.ФактДатаОкончания КАК ФактОкончание    |ИЗ    |   РегистрСведений.ХодВыполненияЗадачи КАК Ход    |ГДЕ    |   Ход.Задача = &Задача";    Запрос.УстановитьПараметр("Задача", ЗадачаСсылка);    Выборка = Запрос.Выполнить().Выбрать();    СтарыйПроцент = 0;    ФактНачало = Неопределено;    ФактОкончание = Неопределено;    Если Выборка.Следующий() Тогда        СтарыйПроцент = Выборка.СтарыйПроцент;        ФактНачало = Выборка.ФактНачало;        ФактОкончание = Выборка.ФактОкончание;    КонецЕсли;    Сегодня = НачалоДня(ТекущаяДатаСеанса());    Если СтарыйПроцент = 0 И Процент >= 1 Тогда        ФактНачало = Сегодня;    КонецЕсли;    Если СтарыйПроцент < 100 И Процент = 100 Тогда        ФактОкончание = Сегодня;    КонецЕсли;    Статус = РассчитатьСтатусЗадачи(Процент, Задача.ПланДатаНачала, Задача.ПланДатаОкончания);    Запись = РегистрыСведений.ХодВыполненияЗадачи.СоздатьМенеджерЗаписи();    Запись.Задача = ЗадачаСсылка;    Запись.Этап = Задача.Владелец;    Запись.Проект = Задача.Владелец.ПолучитьОбъект().Владелец;    Запись.ПроцентВыполнения = Процент;    Запись.СтатусВыполнения = Статус;    Запись.ФактДатаНачала = ФактНачало;    Запись.ФактДатаОкончания = ФактОкончание;    Запись.Записать();КонецПроцедурыФункция РассчитатьСтатусЗадачи(Процент, ПланНачало, ПланОкончание)    Сегодня = НачалоДня(ТекущаяДатаСеанса());        Если Процент = 0 Тогда        Если ЗначениеЗаполнено(ПланНачало) И ПланНачало < Сегодня Тогда            Возврат "Пропущена";        Иначе            Возврат "Запланирована";        КонецЕсли;    ИначеЕсли Процент = 100 Тогда        Возврат "Выполнена";    Иначе        Если ЗначениеЗаполнено(ПланОкончание) И ПланОкончание < Сегодня Тогда            Возврат "Просрочена";        Иначе            Возврат "В исполнении";        КонецЕсли;    КонецЕсли;КонецФункции// ==============================================================// ПЕРЕСЧЕТ ЭТАПОВ// ==============================================================Процедура ПересчитатьЭтап(ЭтапСсылка)

    ЭтапОбъект = ЭтапСсылка.ПолучитьОбъект();
    Если ЭтапОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ЭтапОбъект.Владелец) Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Ход.ПроцентВыполнения,
    |   Ход.ФактДатаНачала,
    |   Ход.ФактДатаОкончания
    |ИЗ
    |   РегистрСведений.ХодВыполненияЗадачи КАК Ход
    |ГДЕ
    |   Ход.Этап = &Этап";

    Запрос.УстановитьПараметр("Этап", ЭтапСсылка);
    Выборка = Запрос.Выполнить().Выбрать();

    СуммаПроцентов = 0;
    КоличествоЗадач = 0;
    МинДатаНачала = Неопределено;
    МаксДатаОкончания = Неопределено;

    Пока Выборка.Следующий() Цикл
        СуммаПроцентов = СуммаПроцентов + Выборка.ПроцентВыполнения;
        КоличествоЗадач = КоличествоЗадач + 1;
        
        Если ЗначениеЗаполнено(Выборка.ФактДатаНачала) Тогда
            Если МинДатаНачала = Неопределено Или Выборка.ФактДатаНачала < МинДатаНачала Тогда
                МинДатаНачала = Выборка.ФактДатаНачала;
            КонецЕсли;
        КонецЕсли;
        
        Если ЗначениеЗаполнено(Выборка.ФактДатаОкончания) Тогда
            Если МаксДатаОкончания = Неопределено Или Выборка.ФактДатаОкончания > МаксДатаОкончания Тогда
                МаксДатаОкончания = Выборка.ФактДатаОкончания;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    Если КоличествоЗадач > 0 Тогда
        Процент = СуммаПроцентов / КоличествоЗадач;
        Процент = Окр(Процент + 0.0001, 0);
        Если Процент > 100 Тогда
            Процент = 100;
        КонецЕсли;
    Иначе
        Процент = 0;
    КонецЕсли;

    Статус = РассчитатьСтатусЭтапа(Процент, ЭтапОбъект.ПланДатаНачала, ЭтапОбъект.ПланДатаОкончания);

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   Ход.ФактДатаНачала КАК СтарыйФактНачало,
    |   Ход.ФактДатаОкончания КАК СтарыйФактОкончание
    |ИЗ
    |   РегистрСведений.ХодВыполненияЭтапа КАК Ход
    |ГДЕ
    |   Ход.Этап = &Этап";
    
    Запрос.УстановитьПараметр("Этап", ЭтапСсылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    СтарыйФактНачало = Неопределено;
    СтарыйФактОкончание = Неопределено;
    
    Если Выборка.Следующий() Тогда
        СтарыйФактНачало = Выборка.СтарыйФактНачало;
        СтарыйФактОкончание = Выборка.СтарыйФактОкончание;
    КонецЕсли;
    
    Сегодня = НачалоДня(ТекущаяДатаСеанса());
    
    // Обновляем фактические даты при изменении процента
    Если СтарыйФактНачало = Неопределено И Процент >= 1 Тогда
        МинДатаНачала = Сегодня;
    КонецЕсли;
    
    Если СтарыйФактОкончание = Неопределено И Процент = 100 Тогда
        МаксДатаОкончания = Сегодня;
    КонецЕсли;

    Запись = РегистрыСведений.ХодВыполненияЭтапа.СоздатьМенеджерЗаписи();
    Запись.Этап = ЭтапСсылка;
    Запись.Проект = ЭтапОбъект.Владелец;
    Запись.ПроцентВыполнения = Процент;
    Запись.СтатусВыполнения = Статус;
    Запись.ФактДатаНачала = МинДатаНачала;
    Запись.ФактДатаОкончания = МаксДатаОкончания;
    Запись.Записать();

КонецПроцедуры

Функция РассчитатьСтатусЭтапа(Процент, ПланНачало, ПланОкончание)

    Сегодня = НачалоДня(ТекущаяДатаСеанса());
    
    Если Процент = 0 Тогда
        Если ЗначениеЗаполнено(ПланНачало) И ПланНачало < Сегодня Тогда
            Возврат "Пропущен";
        Иначе
            Возврат "Запланирован";
        КонецЕсли;
    ИначеЕсли Процент = 100 Тогда
        Возврат "Выполнен";
    Иначе
        Если ЗначениеЗаполнено(ПланОкончание) И ПланОкончание < Сегодня Тогда
            Возврат "Просрочен";
        Иначе
            Возврат "В исполнении";
        КонецЕсли;
    КонецЕсли;

КонецФункции// ==============================================================// ПЕРЕСЧЕТ ПРОЕКТОВ// ==============================================================Процедура ПересчитатьПроект(ПроектСсылка)

    ПроектОбъект = ПроектСсылка.ПолучитьОбъект();
    Если ПроектОбъект = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Ход.ПроцентВыполнения,
    |   Ход.ФактДатаНачала,
    |   Ход.ФактДатаОкончания
    |ИЗ
    |   РегистрСведений.ХодВыполненияЭтапа КАК Ход
    |ГДЕ
    |   Ход.Проект = &Проект";

    Запрос.УстановитьПараметр("Проект", ПроектСсылка);
    Выборка = Запрос.Выполнить().Выбрать();

    СуммаПроцентов = 0;
    КоличествоЭтапов = 0;
    МинДатаНачала = Неопределено;
    МаксДатаОкончания = Неопределено;

    Пока Выборка.Следующий() Цикл
        СуммаПроцентов = СуммаПроцентов + Выборка.ПроцентВыполнения;
        КоличествоЭтапов = КоличествоЭтапов + 1;
        
        Если ЗначениеЗаполнено(Выборка.ФактДатаНачала) Тогда
            Если МинДатаНачала = Неопределено Или Выборка.ФактДатаНачала < МинДатаНачала Тогда
                МинДатаНачала = Выборка.ФактДатаНачала;
            КонецЕсли;
        КонецЕсли;
        
        Если ЗначениеЗаполнено(Выборка.ФактДатаОкончания) Тогда
            Если МаксДатаОкончания = Неопределено Или Выборка.ФактДатаОкончания > МаксДатаОкончания Тогда
                МаксДатаОкончания = Выборка.ФактДатаОкончания;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    Если КоличествоЭтапов = 0 Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   Ход.ПроцентВыполнения,
        |   Ход.ФактДатаНачала,
        |   Ход.ФактДатаОкончания
        |ИЗ
        |   РегистрСведений.ХодВыполненияЗадачи КАК Ход
        |ГДЕ
        |   Ход.Проект = &Проект";

        Запрос.УстановитьПараметр("Проект", ПроектСсылка);
        Выборка = Запрос.Выполнить().Выбрать();
        
        СуммаПроцентов = 0;
        КоличествоЗадач = 0;

        Пока Выборка.Следующий() Цикл
            СуммаПроцентов = СуммаПроцентов + Выборка.ПроцентВыполнения;
            КоличествоЗадач = КоличествоЗадач + 1;
            
            Если ЗначениеЗаполнено(Выборка.ФактДатаНачала) Тогда
                Если МинДатаНачала = Неопределено Или Выборка.ФактДатаНачала < МинДатаНачала Тогда
                    МинДатаНачала = Выборка.ФактДатаНачала;
                КонецЕсли;
            КонецЕсли;
            
            Если ЗначениеЗаполнено(Выборка.ФактДатаОкончания) Тогда
                Если МаксДатаОкончания = Неопределено Или Выборка.ФактДатаОкончания > МаксДатаОкончания Тогда
                    МаксДатаОкончания = Выборка.ФактДатаОкончания;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        
        КоличествоЭтапов = КоличествоЗадач;
        КоличествоЭтапов = ?(КоличествоЭтапов = 0, 1, КоличествоЭтапов);
    КонецЕсли;

    Если КоличествоЭтапов > 0 Тогда
        Процент = СуммаПроцентов / КоличествоЭтапов;
        Процент = Окр(Процент + 0.0001, 0);
        Если Процент > 100 Тогда
            Процент = 100;
        КонецЕсли;
    Иначе
        Процент = 0;
    КонецЕсли;

    Статус = РассчитатьСтатусПроекта(Процент, ПроектОбъект.ПланДатаНачала, ПроектОбъект.ПланДатаОкончания);

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   Ход.ФактДатаНачала КАК СтарыйФактНачало,
    |   Ход.ФактДатаОкончания КАК СтарыйФактОкончание
    |ИЗ
    |   РегистрСведений.ХодВыполненияПроекта КАК Ход
    |ГДЕ
    |   Ход.Проект = &Проект";
    
    Запрос.УстановитьПараметр("Проект", ПроектСсылка);
    Выборка = Запрос.Выполнить().Выбрать();
    
    СтарыйФактНачало = Неопределено;
    СтарыйФактОкончание = Неопределено;
    
    Если Выборка.Следующий() Тогда
        СтарыйФактНачало = Выборка.СтарыйФактНачало;
        СтарыйФактОкончание = Выборка.СтарыйФактОкончание;
    КонецЕсли;
    
    Сегодня = НачалоДня(ТекущаяДатаСеанса());
    
    // Обновляем фактические даты при изменении процента
    Если СтарыйФактНачало = Неопределено И Процент >= 1 Тогда
        МинДатаНачала = Сегодня;
    КонецЕсли;
    
    Если СтарыйФактОкончание = Неопределено И Процент = 100 Тогда
        МаксДатаОкончания = Сегодня;
    КонецЕсли;

    Запись = РегистрыСведений.ХодВыполненияПроекта.СоздатьМенеджерЗаписи();
    Запись.Проект = ПроектСсылка;
    Запись.ПроцентВыполнения = Процент;
    Запись.СтатусВыполнения = Статус;
    Запись.ФактДатаНачала = МинДатаНачала;
    Запись.ФактДатаОкончания = МаксДатаОкончания;
    Запись.Записать();

КонецПроцедуры

Функция РассчитатьСтатусПроекта(Процент, ПланНачало, ПланОкончание)

    Сегодня = НачалоДня(ТекущаяДатаСеанса());
    
    Если Процент = 0 Тогда
        Если ЗначениеЗаполнено(ПланНачало) И ПланНачало < Сегодня Тогда
            Возврат "Пропущен";
        Иначе
            Возврат "Запланирован";
        КонецЕсли;
    ИначеЕсли Процент = 100 Тогда
        Возврат "Выполнен";
    Иначе
        Если ЗначениеЗаполнено(ПланОкончание) И ПланОкончание < Сегодня Тогда
            Возврат "Просрочен";
        Иначе
            Возврат "В исполнении";
        КонецЕсли;
    КонецЕсли;

КонецФункции
